from ftplib import FTP
import xml.dom.minidom as xmldom
from pyModbusTCP.client import ModbusClient
from pyModbusTCP import utils
import struct
from pymysql import connect
import datetime
import time
from multiprocessing import Queue
import threading


class Storage_Data(object):
    def __init__(self):
        # self.host = input("请输入IP地址：")
        # self.port = int(input("请输入端口号："))
        # self.username = input("请输入用户名：")
        # self.password = input("请输入密码：")
        self.host = "192.168.1.201"
        self.port = 2121
        self.username = "ftp"
        self.password = "ftp"
        self.remote_path = "/data/mgrid/sampler/modbus_map.xml"
        self.__file = "./modbus_map.xml"
        self.__old_str = "&"
        self.__new_str = "-"
        self.equipid_list = []
        self.sigid_list = []
        self.reg_addr_list = []
        self.name_list = []
        self.__client = ModbusClient(host=self.host, port=502, debug=True, auto_open=True)
        self.__address = 0
        self.__register = 50
        self.i = 0
        self.__conn = connect(host='localhost', port=3306, database="MOTTA_data", user="root", password="mysql",
                              charset="utf8")
        self.__cur = self.__conn.cursor()
        self.float_data = []  # 检测获取到的数据

    # 1.获取map表（xml格式）
    def ftp_connect(self):
        # 初始化FTP
        ftp = FTP()
        # 连接IP地址和端口
        ftp.connect(self.host, self.port)
        # 输入帐号密码登录，如果匿名登录则用空串代替即可
        ftp.login(self.username, self.password)
        # 返回FTP对象
        return ftp

    # 2.下载xml文件
    def download_file(self):
        # 调用ftp_connect()方法 下载文件
        ftp = self.ftp_connect()
        # 设置缓冲块大小
        bufsize = 1024
        # 以写模式在本地打开文件(当前目录)
        fp = open("./modbus_map.xml", 'wb')
        # 接收服务器上文件并写入本地文件
        ftp.retrbinary('RETR ' + self.remote_path, fp.write, bufsize)
        # 关闭文件
        fp.close()
        # 退出FTP
        self.ftp_connect().quit()

    # -------------------------------------《处理下载的xml文件》--------------------------------------------------

    # 3.替换字符串&，符串&在xml文件中属于特殊字符串，在解析获取xml文件内容时会因为字符串报错
    def replace_string(self):
        self.download_file()
        # 将xml文件中的&替换成-(XML文件有五个不允许出现的特殊字符)
        file_data = ""
        # 打开下载到本地的xml文件
        with open(self.__file, "r", encoding="utf-8") as f:
            # 遍历xml文件行
            for line in f:
                if self.__old_str in line:
                    # Python replace() 方法把字符串中的 old（旧字符串） 替换成 new(新字符串)，如果指定第三个参数max，则替换不超过 max 次。
                    line = line.replace(self.__old_str, self.__new_str)
                file_data += line
        # w：打开一个文件只用于写入。如果该文件已存在则打开文件，并从开头开始编辑，即原有内容会被删除。如果该文件不存在，创建新文件。
        with open(self.__file, "w", encoding="utf-8") as f:
            # 替换含有$字符串的行
            f.write(file_data)

    # 4.获取数据列表(equipid=[...] sigid=[...] reg_addr=[...] name=[...])
    def get_data_list(self):
        self.replace_string()
        # 打开下载到本地的xml文档对象
        dom = xmldom.parse(self.__file)
        # 得到文档元素对象 documentElement 属性可返回文档的根节点。
        root = dom.documentElement
        # getElementsByTagName() 方法可返回带有指定标签名的对象的集合（是一个文档对象）
        document_object = root.getElementsByTagName('signal')
        # 遍历<signal>标签 对象集合
        for item in document_object:
            # getAttribute()方法返回指定属性名的属性值。
            equipid = item.getAttribute("equipid")
            # 将获取的‘equipid’属性值，存到equipid_list列表中
            self.equipid_list.append(equipid)
            sigid = item.getAttribute("sigid")
            self.sigid_list.append(sigid)
            reg_addr = item.getAttribute("reg_addr")
            self.reg_addr_list.append(reg_addr)
            name = item.getAttribute("name")
            self.name_list.append(name)

    # -------------------------------------《IP地址和int类型的互相转换》---------------------------------------
    # IP转int型
    def iptoint(self, num):
        list = []
        s = num.split(".")
        for temp in s:
            a = bin(int(temp))[2:]
            a = a.zfill(8)
            list.append(a)
        g = "".join(list)
        e = int(g, 2)
        return e

    def inttoip(self, num):
        s = bin(num)[2:]
        s = s.zfill(32)
        g = []
        h = []
        for i in range(0, 32, 8):
            g.append(s[i:i + 8])
        for temp in g:
            h.append(str(int(temp, 2)))
        e = ".".join(h)
        return e

    # -------------------------------------《通过modbus-tcp协议获取实时数据》---------------------------------------

    # 5.实时更新数据并添加到数据库(实时通过while循环反复存储)
    def get_realtime_data(self):
        # 判断是否连接成功 （否 否为真）
        if not self.__client.is_open() and not self.__client.open():
            # 在次连接一次，没有连接上则抛出错误
            raise RuntimeError('无法连接：请检查端口或IP地址是否正确')
        while True:
            time.sleep(3)
            if self.__address < len(self.name_list):
                """
                1.改写源码(read_holding_registers)：源码返回的数据为32位 协议为64位数据对不上，通过调试模式返Rx数据，返回数据为（registers, re_debug）
                2.开启调试模式获re_debug 
                """
                registers, re_debug = self.__client.read_holding_registers(self.__address, self.__register)
                # 获取50个数据（字符串类型）
                # print(re_debug)
                str_list = re_debug.split(" ")[9:-1]
                a = [str_list[x:x + 4] for x in range(0, len(str_list), 4)]
                # print(len(a))
                for x in a:
                    b = "".join(x)
                    # print(b)
                    # 前面四位不动 后面四位两两交换位置（注意转浮点数时候大端小端问题）
                    c = b[0:4] + b[-2:] + b[4:6]
                    # print(c)
                    # 4位16进制数 转浮点数
                    d = "%.2f" % struct.unpack('<f', bytes.fromhex(c))[0]
                    # print("%d正在获取(%s)的数据: %s" % (self.i, self.name_list[self.i], d))
                    self.input_data(d)
                    self.i += 1
                self.__address += 50
            else:
                self.i = 0
                self.__address = 0
                # time.sleep(3)
                break

    # 6.存入数据库
    def input_data(self, float_data):

        # 将得到的浮点数数据存入到数据库
        # 获取当前时间
        nowTime = datetime.datetime.now()
        # 格式化当前时间
        strTime = nowTime.strftime("%Y-%m-%d %H:%M:%S")
        # 逻辑删除（在drf中自定义模型，逻辑删除健，设置了默认值，但是只有通过drf存储时才会有默认值，直接在数据库中存储是不会添加默认值的）
        is_delete = False
        # divice_ip = self.iptoint(self.host)
        divice_ip = self.host
        # print(type(divice_ip))
        data = [self.equipid_list[self.i], self.sigid_list[self.i], self.reg_addr_list[self.i],
                self.name_list[self.i], float_data,
                strTime, is_delete, divice_ip]
        sql_str = '''insert into tb_xmldata (equipid, sigid, reg_addr, name, float_data, data_time, is_delete, divice_ip) values(%s, %s, %s, %s, %s, %s, %s, %s);'''
        self.__cur.execute(sql_str, data)
        self.__conn.commit()


if __name__ == "__main__":
    ftp = Storage_Data()
    ftp.get_data_list()
    while True:
        # start = time.time()
        ftp.get_realtime_data()
        # end = time.time()
        print(datetime.datetime.now())

list_alarm = [
    {"监控屏IO": [
        {"监控屏IO, 烟感": ["烟雾告警", "有告警", "严重告警", "-", 1, {"max_id": 0}]},
        {"监控屏IO, 漏水": ["漏水告警", "有告警", "严重告警", "-", 1, {"max_id": 0}]},
        {"监控屏IO, 机柜门": ["机柜门", "打开", "一般告警", "-", 1, {"max_id": 0}]},
        {"监控屏IO, 通讯状态": ["设备通讯状态", "通讯中断", "一般告警", "-", 1, {"max_id": 0}]}]},

    {"温湿度": [
        {"温湿度, 温度": ["高温告警", "有告警", "严重告警", "℃", 41, {"max_id": 0}]},
        {"温湿度, 温度": ["低温告警", "有告警", "一般告警", "℃", 10, {"max_id": 0}]},
        {"温湿度, 湿度": ["高湿告警", "有告警", "一般告警", "%Rh", 95, {"max_id": 0}]},
        {"温湿度, 湿度": ["低湿告警", "有告警", "一般告警", "%Rh", 10, {"max_id": 0}]},
        {"温湿度, 设备通讯状态": ["设备通讯状态", "通讯中断", "严重告警", "-", 1, {"max_id": 0}]}
    ]},

    {"UPS": [
        {"UPS, 市电异常": ["市电异常", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 旁路/逆变": ["旁路/逆变", "有效", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, UPS故障": ["UPS故障", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, EPO": ["EPO", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 测试状态": ["测试状态", "测试中", "通知", "-", 1, {"max_id": 0}]},
        {"UPS, 关机有效": ["关机有效", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 电池测试失败": ["电池测试失败", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 电池未接": ["电池未接", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 电池过充": ["电池过充", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 电池低压": ["电池低压", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 输出过载": ["输出过载", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 风扇堵转": ["风扇堵转", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 过温": ["过温", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 充电器故障": ["充电器故障", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, L1输入保险开路": ["L1输入保险开路报警", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 维护开关盖打开": ["维护开关盖打开", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 设备通讯状态": ["通讯中断", "有告警", "严重告警", "-", 1, {"max_id": 0}]}]},
    {"主路电表": [
        {"主路电表, 设备通讯状态": ["设备通讯状态", "通讯中断", "严重告警", "-", 1, {"max_id": 0}]}]},
    {"IT负载电表": [
        {"IT负载电表, 设备通讯状态": ["设备通讯状态", "通讯中断", "严重告警", "-", 1, {"max_id": 0}]}]},
    {"空调": [
        {"空调, 吸气温度探头故障": ["吸气温度探头故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 送风温度探头故障": ["送风温度探头故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 吸气压力探头故障": ["吸气压力探头故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 排气压力探头故障": ["排气压力探头故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 回风温度探头故障": ["回风温度探头故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 回风湿度探头故障": ["回风湿度探头故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 温度过高": ["温度过高", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 送风温度过低": ["送风温度过低", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 湿度过高": ["湿度过高", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 湿度过低": ["湿度过低", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 水溢报警": ["水溢报警", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 漏水报警": ["漏水报警", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 高压保护开关": ["高压保护开关", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 低压保护开关": ["低压保护开关", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 烟雾报警": ["烟雾报警", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 送风机故障": ["送风机故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 加湿器故障": ["加湿器故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 电加热故障": ["电加热故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 水泵故障": ["水泵故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 低压压力报警": ["低压压力报警", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 电流过载": ["电流过载", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 排气压力过高报警": ["排气压力过高报警", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 压缩机内部故障": ["压缩机内部故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 压缩机通讯故障": ["通讯故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 设备通讯状态": ["设备通讯状态", "通讯中断", "严重告警", "-", 1, {"max_id": 0}]}]}
]

list_eq = [

    {"监控屏IO": [
        {"监控屏IO, 烟感": [{"name": "烟感"}, {"unit": "-"}, {"0": "告警"}, {"1": "正常"}, {"max_id": 0}]},
        {"监控屏IO, 漏水": [{"name": "漏水"}, {"unit": "-"}, {"0": "告警"}, {"1": "正常"}, {"max_id": 0}]},
        {"监控屏IO, 机柜门": [{"name": "机柜门"}, {"unit": "-"}, {"0": "关闭"}, {"1": "打开"}, {"max_id": 0}]},
        {"监控屏IO, DI4": [{"name": "DI4"}, {"unit": "-"}, {"0": "有输入"}, {"1": "无输入"}, {"max_id": 0}]},
        {"监控屏IO, DI5": [{"name": "DI5"}, {"unit": "-"}, {"0": "有输入"}, {"1": "无输入"}, {"max_id": 0}]},
        {"监控屏IO, 通讯状态": [{"name": "通讯状态"}, {"unit": "-"}, {"0": "中断"}, {"1": "正常"}, {"max_id": 0}]}]},
    {"温湿度": [
        {"温湿度, 温度": [{"name": "温度"}, {"unit": "℃"}, {"max_id": 0}]},
        {"温湿度, 湿度": [{"name": "湿度"}, {"unit": "%Rh"}, {"max_id": 0}]},
        {"温湿度, 门开启温度": [{"name": "门开启温度"}, {"unit": "℃"}, {"max_id": 0}]},
        {"温湿度, 门关闭温度": [{"name": "门关闭温度"}, {"unit": "℃"}, {"max_id": 0}]},
        {"温湿度, 设备通讯状态": [{"name": "设备通讯状态"}, {"unit": "-"}, {"0": "中断"}, {"1": "正常"}, {"max_id": 0}]}]},
    {"UPS": [
        {"UPS, 输入电压": [{"name": "输入电压"}, {"unit": "V"}, {"max_id": 0}]},
        {"UPS, 输入频率": [{"name": "输入频率"}, {"unit": "Hz"}, {"max_id": 0}]},
        {"UPS, 输出电压": [{"name": "输出电压"}, {"unit": "V"}, {"max_id": 0}]},
        {"UPS, 输出频率": [{"name": "输出频率"}, {"unit": "Hz"}, {"max_id": 0}]},
        {"UPS, 输出电流": [{"name": "输出电流"}, {"unit": "A"}, {"max_id": 0}]},
        {"UPS, 输出负载率": [{"name": "输出负载率"}, {"unit": "%"}, {"max_id": 0}]},
        {"UPS, 正母线电压": [{"name": "正母线电压"}, {"unit": "V"}, {"max_id": 0}]},
        {"UPS, 负母线电压": [{"name": "负母线电压"}, {"unit": "V"}, {"max_id": 0}]},
        {"UPS, 电池电压": [{"name": "电池电压"}, {"unit": "V"}, {"max_id": 0}]},
        {"UPS, 最大检测温度": [{"name": "最大检测温度"}, {"unit": "℃"}, {"max_id": 0}]},
        {"UPS, UPS类型": [{"name": "UPS类型"}, {"unit": "-"}, {"0": "后备式"}, {"1": "在线互动式"}, {"10": "在线式"}, {"max_id": 0}]},
        {"UPS, 市电异常": [{"name": "市电异常"}, {"unit": "-"}, {"0": "正常"}, {"1": "告警"}, {"max_id": 0}]},
        {"UPS, 电池低压": [{"name": "电池低压"}, {"unit": "-"}, {"0": "正常"}, {"1": "告警"}, {"max_id": 0}]},
        {"UPS, 旁路/逆变": [{"name": "旁路/逆变"}, {"unit": "-"}, {"0": "正常"}, {"1": "有效"}, {"max_id": 0}]},
        {"UPS, UPS故障": [{"name": "UPS故障"}, {"unit": "-"}, {"0": "正常"}, {"1": "告警"}, {"max_id": 0}]},
        {"UPS, EPO": [{"name": "EPO"}, {"unit": "-"}, {"0": "正常"}, {"1": "告警"}, {"max_id": 0}]},
        {"UPS, 测试状态": [{"name": "测试状态"}, {"unit": "-"}, {"0": "非测试"}, {"1": "测试中"}, {"max_id": 0}]},
        {"UPS, 关机有效": [{"name": "关机有效"}, {"unit": "-"}, {"0": "正常"}, {"1": "关机"}, {"max_id": 0}]},
        {"UPS, 电池静音": [{"name": "电池静音"}, {"unit": "-"}, {"0": "非静音"}, {"1": "静音"}, {"max_id": 0}]},
        {"UPS, 电池测试失败": [{"name": "电池测试失败"}, {"unit": "-"}, {"0": "无"}, {"1": "失败"}, {"max_id": 0}]},
        {"UPS, 电池测试正常": [{"name": "电池测试正常"}, {"unit": "-"}, {"0": "无"}, {"1": "正常"}, {"max_id": 0}]},
        {"UPS, 电池未接": [{"name": "电池未接"}, {"unit": "-"}, {"0": "正常"}, {"1": "告警"}, {"max_id": 0}]},
        {"UPS, 电池过充": [{"name": "电池过充"}, {"unit": "-"}, {"0": "正常"}, {"1": "告警"}, {"max_id": 0}]},
        {"UPS, 电池低压": [{"name": "电池低压"}, {"unit": "-"}, {"0": "正常"}, {"1": "告警"}, {"max_id": 0}]},
        {"UPS, 输出过载": [{"name": "输出过载"}, {"unit": "-"}, {"0": "正常"}, {"1": "告警"}, {"max_id": 0}]},
        {"UPS, 风扇堵转": [{"name": "风扇堵转"}, {"unit": "-"}, {"0": "正常"}, {"1": "告警"}, {"max_id": 0}]},
        {"UPS, EPO激活": [{"name": "EPO激活"}, {"unit": "-"}, {"0": "无效"}, {"1": "生效"}, {"max_id": 0}]},
        {"UPS, 过温": [{"name": "过温"}, {"unit": "-"}, {"0": "正常"}, {"1": "告警"}, {"max_id": 0}]},
        {"UPS, 充电器故障": [{"name": "充电器故障"}, {"unit": "-"}, {"0": "正常"}, {"1": "告警"}, {"max_id": 0}]},
        {"UPS, L1输入保险开路": [{"name": "L1输入保险开路"}, {"unit": "-"}, {"0": "正常"}, {"1": "告警"}, {"max_id": 0}]},
        {"UPS, 维护开关盖打开": [{"name": "维护开关盖打开"}, {"unit": "-"}, {"0": "正常"}, {"1": "告警"}, {"max_id": 0}]},
        {"UPS, UPS模式": [{"name": "UPS模式"}, {"unit": "-"}, {"80": "开机"}, {"83": "待机"}, {"89": "旁路"}, {"76": "Line"},
                        {"66": "电池供电"}, {"84": "电池测试"}, {"70": "故障"}, {"69": "HE/ECO"}, {"67": "Converter"},
                        {"68": "关机"}, {"max_id": 0}]},
        {"UPS, 电池电压": [{"name": "电池电压"}, {"unit": "V"}, {"max_id": 0}]},
        {"UPS, 电池节数": [{"name": "电池节数"}, {"unit": "-"}, {"max_id": 0}]},
        {"UPS, 电池组数": [{"name": "电池组数"}, {"unit": "-"}, {"max_id": 0}]},
        {"UPS, 电池容量": [{"name": "电池容量"}, {"unit": "%"}, {"max_id": 0}]},
        {"UPS, 电池剩余时间": [{"name": "电池剩余时间"}, {"unit": "min"}, {"max_id": 0}]},
        {"UPS, 输出功率因素": [{"name": "输出功率因素"}, {"unit": "-"}, {"max_id": 0}]},
        {"UPS, 输入相数": [{"name": "输入相数"}, {"unit": "-"}, {"max_id": 0}]},
        {"UPS, 输出相数": [{"name": "输出相数"}, {"unit": "-"}, {"max_id": 0}]},
        {"UPS, 输入故障电压": [{"name": "输入故障电压"}, {"unit": "V"}, {"max_id": 0}]},
        {"UPS, 输出故障电压": [{"name": "输出故障电压"}, {"unit": "V"}, {"max_id": 0}]},
        {"UPS, 额定电池节数": [{"name": "额定电池节数"}, {"unit": "-"}, {"max_id": 0}]},
        {"UPS, 额定电池单体电压": [{"name": "额定电池单体电压"}, {"unit": "V"}, {"max_id": 0}]},
        {"UPS, 错误码": [{"name": "错误码"}, {"unit": "-"}, {"0": "无故障"}, {"1": "BUS电压启动失败"}, {"2": "BUS电压过高"},
                      {"3": "BUS电压过低"}, {"4": "BUS电压不平衡"}, {"5": "BUS电压下降斜率过快"}, {"6": "PFC输入电感电流过大"},
                      {"17": "Inverter软启动失败"}, {"18": "Inverter电压过高"}, {"19": "Inverter电压过低"}, {"20": "L1 Inverter短路"},
                      {"21": "L2 Inverter短路"}, {"22": "L3 Inverter短路"}, {"23": "L1L2 Inverter短路"},
                      {"24": "L2L3 Inverter短路"}, {"25": "L3L1 Inverter短路"}, {"26": "L1 Inverter负功率超范围"},
                      {"27": "L2 Inverter负功率超范围"}, {"28": "L3 Inverter负功率超范围"}, {"33": "电池SCR故障"}, {"34": "Line SCR故障"},
                      {"35": "Inverter继电器开路故障"}, {"36": "Inverter继电器短路故障"}, {"37": "输入输出线路接反"}, {"38": "电池反接故障"},
                      {"39": "电池电压过高"}, {"40": "电池电压过低"}, {"41": "电池FUSE开路故障"}, {"49": "CANBus通讯故障"},
                      {"50": "主机信号线路故障"}, {"51": "同步信号线路故障"}, {"52": "同步触发信号线路故障"}, {"53": "并机通信线路丢失故障"},
                      {"54": "输出严重不均流故障"}, {"65": "温度过高"}, {"66": "控制板中CPU间通讯故障"}, {"67": "过载故障"}, {"68": "风扇模组故障"},
                      {"69": "充电器故障"}, {"70": "机型错误"}, {"71": "控制板与通讯板MCU通讯故障"}, {"max_id": 0}]},
        {"UPS, UPS简化模式": [{"name": "UPS简化模式"}, {"unit": "-"}, {"0": "待机/关机"}, {"1": "旁路"}, {"2": "市电"}, {"3": "电池"},
                          {"max_id": 0}]},
        {"UPS, 设备通讯状态": [{"name": "设备通讯状态"}, {"unit": "-"}, {"0": "通讯中断"}, {"1": "通讯正常"}, {"max_id": 0}]}]},
    {"主路电表": [
        {"主路电表, 当前组合有功电能": [{"name": "当前组合有功电能"}, {"unit": "Kwh"}, {"max_id": 0}]},
        {"主路电表, 当前正向有功电能": [{"name": "当前正向有功电能"}, {"unit": "Kwh"}, {"max_id": 0}]},
        {"主路电表, 当前反向有功电能": [{"name": "当前反向有功电能"}, {"unit": "Kwh"}, {"max_id": 0}]},
        {"主路电表, 电压": [{"name": "电压"}, {"unit": "V"}, {"max_id": 0}]},
        {"主路电表, 电流": [{"name": "电流"}, {"unit": "A"}, {"max_id": 0}]},
        {"主路电表, 功率": [{"name": "功率"}, {"unit": "Kw"}, {"max_id": 0}]},
        {"主路电表, 功率因数": [{"name": "功率因数"}, {"unit": "-"}, {"max_id": 0}]},
        {"主路电表, 频率": [{"name": "频率"}, {"unit": "Hz"}, {"max_id": 0}]},
        {"主路电表, 设备通讯状态": [{"name": "设备通讯状态"}, {"unit": "-"}, {"0": "通讯中断"}, {"1": "通讯正常"}, {"max_id": 0}]}]},
    {"IT负载电表": [
        {"主路电表, 当前组合有功电能": [{"name": "当前组合有功电能"}, {"unit": "Kwh"}, {"max_id": 0}]},
        {"主路电表, 当前正向有功电能": [{"name": "当前正向有功电能"}, {"unit": "Kwh"}, {"max_id": 0}]},
        {"主路电表, 当前反向有功电能": [{"name": "当前反向有功电能"}, {"unit": "Kwh"}, {"max_id": 0}]},
        {"主路电表, 电压": [{"name": "电压"}, {"unit": "V"}, {"max_id": 0}]},
        {"主路电表, 电流": [{"name": "电流"}, {"unit": "A"}, {"max_id": 0}]},
        {"主路电表, 功率": [{"name": "功率"}, {"unit": "Kw"}, {"max_id": 0}]},
        {"主路电表, 功率因数": [{"name": "功率因数"}, {"unit": "-"}, {"max_id": 0}]},
        {"主路电表, 频率": [{"name": "频率"}, {"unit": "Hz"}, {"max_id": 0}]},
        {"主路电表, 设备通讯状态": [{"name": "设备通讯状态"}, {"unit": "-"}, {"0": "通讯中断"}, {"1": "通讯正常"}, {"max_id": 0}]}]},

    {"空调": [
        {"空调, 吸气温度探头故障": [{"name": "吸气温度探头故障"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 送风温度探头故障": [{"name": "送风温度探头故障"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 吸气压力探头故障": [{"name": "吸气压力探头故障"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 排气压力探头故障": [{"name": "排气压力探头故障"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 回风温度探头故障": [{"name": "回风温度探头故障"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 回风湿度探头故障": [{"name": "回风湿度探头故障"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 温度过高": [{"name": "温度过高"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 送风温度过低": [{"name": "送风温度过低"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 湿度过高": [{"name": "湿度过高"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 湿度过低": [{"name": "湿度过低"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 水溢报警": [{"name": "水溢报警"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 漏水报警": [{"name": "漏水报警"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 高压保护开关": [{"name": "高压保护开关"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 低压保护开关": [{"name": "低压保护开关"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 烟雾报警": [{"name": "烟雾报警"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 送风机故障": [{"name": "送风机故障"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 加湿器故障": [{"name": "加湿器故障"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 电加热故障": [{"name": "电加热故障"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 水泵故障": [{"name": "水泵故障"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 低压压力报警": [{"name": "低压压力报警"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 电流过载": [{"name": "电流过载"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 排气压力过高报警": [{"name": "排气压力过高报警"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 压缩机内部故障": [{"name": "压缩机内部故障"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 压缩机通讯故障": [{"name": "压缩机通讯故障"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 送风机": [{"name": "送风机"}, {"unit": "-"}, {"0": "关闭"}, {"1": "开启"}, {"max_id": 0}]},
        {"空调, 压缩机": [{"name": "压缩机"}, {"unit": "-"}, {"0": "关闭"}, {"1": "开启"}, {"max_id": 0}]},
        {"空调, 冷凝水泵": [{"name": "冷凝水泵"}, {"unit": "-"}, {"0": "关闭"}, {"1": "开启"}, {"max_id": 0}]},
        {"空调, 低温电磁阀": [{"name": "低温电磁阀"}, {"unit": "-"}, {"0": "关闭"}, {"1": "开启"}, {"max_id": 0}]},
        {"空调, 故障": [{"name": "故障"}, {"unit": "-"}, {"0": "正常"}, {"1": "故障"}, {"max_id": 0}]},
        {"空调, 远控": [{"name": "远控"}, {"unit": "-"}, {"0": "关闭"}, {"1": "开启"}, {"max_id": 0}]},
        {"空调, 开关机": [{"name": "开关机"}, {"unit": "-"}, {"0": "关闭"}, {"1": "开启"}, {"max_id": 0}]},
        {"空调, 温度设定": [{"name": "温度设定"}, {"unit": "℃"}, {"max_id": 0}]},
        {"空调, 湿度设置": [{"name": "湿度设置"}, {"unit": "%"}, {"max_id": 0}]},
        {"空调, 来电自启动": [{"name": "来电自启动"}, {"unit": "-"}, {"0": "禁用"}, {"1": "启用"}, {"max_id": 0}]},
        {"空调, 温度回差": [{"name": "温度回差"}, {"unit": "℃"}, {"max_id": 0}]},
        {"空调, 湿度回差": [{"name": "湿度回差"}, {"unit": "%"}, {"max_id": 0}]},
        {"空调, 除湿使能": [{"name": "除湿使能"}, {"unit": "-"}, {"0": "禁用"}, {"1": "启用"}, {"max_id": 0}]},
        {"空调, 联网地址设置": [{"name": "联网地址设置"}, {"unit": "-"}, {"max_id": 0}]},
        {"空调, 压缩机电流过载": [{"name": "压缩机电流过载"}, {"unit": "A"}, {"max_id": 0}]},
        {"空调, 控制方式": [{"name": "控制方式"}, {"unit": "-"}, {"0": "回风"}, {"1": "送风"}, {"max_id": 0}]},
        {"空调, 吸气压力量程": [{"name": "吸气压力量程"}, {"unit": "Bar"}, {"max_id": 0}]},
        {"空调, 最低送风温度": [{"name": "最低送风温度"}, {"unit": "℃"}, {"max_id": 0}]},
        {"空调, 最高送风温度": [{"name": "最高送风温度"}, {"unit": "℃"}, {"max_id": 0}]},
        {"空调, 高温报警": [{"name": "高温报警"}, {"unit": "℃"}, {"max_id": 0}]},
        {"空调, 送风低温报警": [{"name": "送风低温报警"}, {"unit": "℃"}, {"max_id": 0}]},
        {"空调, 高湿报警": [{"name": "高湿报警"}, {"unit": "%"}, {"max_id": 0}]},
        {"空调, 低湿报警": [{"name": "低湿报警"}, {"unit": "%"}, {"max_id": 0}]},
        {"空调, 吸气压力报警": [{"name": "吸气压力报警"}, {"unit": "Bar"}, {"max_id": 0}]},
        {"空调, 排气压力量程": [{"name": "排气压力量程"}, {"unit": "Bar"}, {"max_id": 0}]},
        {"空调, 排压压力报警": [{"name": "排压压力报警"}, {"unit": "Bar"}, {"max_id": 0}]},
        {"空调, 送风机输出": [{"name": "送风机输出"}, {"unit": "%"}, {"max_id": 0}]},
        {"空调, 机组运行时间": [{"name": "机组运行时间"}, {"unit": "-"}, {"max_id": 0}]},
        {"空调, 压机运行时间": [{"name": "压机运行时间"}, {"unit": "-"}, {"max_id": 0}]},
        {"空调, 过热度": [{"name": "过热度"}, {"unit": "℃"}, {"max_id": 0}]},
        {"空调, EEV开度": [{"name": "EEV开度"}, {"unit": "%"}, {"max_id": 0}]},
        {"空调, 吸气温度": [{"name": "吸气温度"}, {"unit": "℃"}, {"max_id": 0}]},
        {"空调, 送风温度": [{"name": "送风温度"}, {"unit": "℃"}, {"max_id": 0}]},
        {"空调, 吸气压力": [{"name": "吸气压力"}, {"unit": "Bar"}, {"max_id": 0}]},
        {"空调, 排气压力": [{"name": "排气压力"}, {"unit": "Bar"}, {"max_id": 0}]},
        {"空调, 室内温度": [{"name": "室内温度"}, {"unit": "℃"}, {"max_id": 0}]},
        {"空调, 室内湿度": [{"name": "室内湿度"}, {"unit": "%"}, {"max_id": 0}]},
        {"空调, 压缩机频率": [{"name": "压缩机频率"}, {"unit": "Hz"}, {"max_id": 0}]},
        {"空调, 蒸发温度": [{"name": "蒸发温度"}, {"unit": "℃"}, {"max_id": 0}]},
        {"空调, 滤网维护故障": [{"name": "滤网维护故障"}, {"unit": "-"}, {"0": "故障"}, {"1": "正常"}, {"max_id": 0}]},
        {"空调, 制热开偏差": [{"name": "制热开偏差"}, {"unit": "℃"}, {"max_id": 0}]},
        {"空调, 制热关偏差": [{"name": "制热关偏差"}, {"unit": "℃"}, {"max_id": 0}]},
        {"空调, 加湿使能": [{"name": "加湿使能"}, {"unit": "-"}, {"0": "禁止"}, {"1": "使能"}, {"max_id": 0}]},
        {"空调, 加热使能": [{"name": "加热使能"}, {"unit": "-"}, {"0": "禁止"}, {"1": "使能"}, {"max_id": 0}]},
        {"空调, 变频器工作状态": [{"name": "变频器工作状态"}, {"unit": "-"}, {"0": "通讯中断"}, {"1": "通讯正常"}, {"max_id": 0}]},
        {"空调, 电加热": [{"name": "电加热"}, {"unit": "-"}, {"0": "关闭"}, {"1": "开启"}, {"max_id": 0}]},
        {"空调, 加湿器": [{"name": "加湿器"}, {"unit": "-"}, {"0": "关闭"}, {"1": "开启"}, {"max_id": 0}]},
        {"空调, 旁通电磁阀": [{"name": "旁通电磁阀"}, {"unit": "-"}, {"0": "关闭"}, {"1": "开启"}, {"max_id": 0}]},
        {"空调, 液管温度": [{"name": "液管温度"}, {"unit": "℃"}, {"max_id": 0}]},
        {"空调, 设备通讯状态": [{"name": "设备通讯状态"}, {"unit": "-"}, {"0": "通讯中断"}, {"1": "通讯正常"}, {"max_id": 0}]}]}
]
