from django.http.response import JsonResponse
from django.db.models import Q, F, Max
from django.http import HttpResponse
from .models import Warning
from createdata.models import XmlData, EquipmentData
import json, copy

# 告警列表
list = [

    {"监控屏IO": [
        {"监控屏IO, 烟感": ["烟雾告警", "有告警", "严重告警", "-", 1, {"max_id": 0}]},
        {"监控屏IO, 漏水": ["漏水告警", "有告警", "严重告警", "-", 1, {"max_id": 0}]},
        {"监控屏IO, 机柜门": ["机柜门", "打开", "一般告警", "-", 0, {"max_id": 0}]},
        {"监控屏IO, 通讯状态": ["设备通讯状态", "通讯中断", "一般告警", "-", 1, {"max_id": 0}]}]},

    {"温湿度": [
        {"温湿度, 温度": ["高温告警", "有告警", "严重告警", "℃", 41, {"max_id": 0}]},
        {"温湿度, 温度": ["低温告警", "有告警", "一般告警", "℃", 10, {"max_id": 0}]},
        {"温湿度, 湿度": ["高湿告警", "有告警", "一般告警", "%Rh", 95, {"max_id": 0}]},
        {"温湿度, 湿度": ["低湿告警", "有告警", "一般告警", "%Rh", 10, {"max_id": 0}]},
        {"温湿度, 设备通讯状态": ["设备通讯状态", "通讯中断", "严重告警", "-", 1, {"max_id": 0}]}
    ]},

    {"UPS": [
        {"UPS, 市电异常": ["市电异常", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 旁路/逆变": ["旁路/逆变", "有效", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, UPS故障": ["UPS故障", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, EPO": ["EPO", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 测试状态": ["测试状态", "测试中", "通知", "-", 1, {"max_id": 0}]},
        {"UPS, 关机有效": ["关机有效", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 电池测试失败": ["电池测试失败", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 电池未接": ["电池未接", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 电池过充": ["电池过充", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 电池低压": ["电池低压", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 输出过载": ["输出过载", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 风扇堵转": ["风扇堵转", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 过温": ["过温", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 充电器故障": ["充电器故障", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, L1输入保险开路": ["L1输入保险开路报警", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 维护开关盖打开": ["维护开关盖打开", "有告警", "一般告警", "-", 1, {"max_id": 0}]},
        {"UPS, 设备通讯状态": ["设备通讯状态", "通讯中断", "严重告警", "-", 1, {"max_id": 0}]}]},
    {"主路电表": [
        {"主路电表, 设备通讯状态": ["设备通讯状态", "通讯中断", "严重告警", "-", 1, {"max_id": 0}]}]},
    {"IT负载电表": [
        {"IT负载电表, 设备通讯状态": ["设备通讯状态", "通讯中断", "严重告警", "-", 1, {"max_id": 0}]}]},
    {"空调": [
        {"空调, 吸气温度探头故障": ["吸气温度探头故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 送风温度探头故障": ["送风温度探头故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 吸气压力探头故障": ["吸气压力探头故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 排气压力探头故障": ["排气压力探头故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 回风温度探头故障": ["回风温度探头故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 回风湿度探头故障": ["回风湿度探头故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 温度过高": ["温度过高", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 送风温度过低": ["送风温度过低", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 湿度过高": ["湿度过高", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 湿度过低": ["湿度过低", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 水溢报警": ["水溢报警", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 漏水报警": ["漏水报警", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 高压保护开关": ["高压保护开关", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 低压保护开关": ["低压保护开关", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 烟雾报警": ["烟雾报警", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 送风机故障": ["送风机故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 加湿器故障": ["加湿器故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 电加热故障": ["电加热故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 水泵故障": ["水泵故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 低压压力报警": ["低压压力报警", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 电流过载": ["电流过载", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 排气压力过高报警": ["排气压力过高报警", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 压缩机内部故障": ["压缩机内部故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        {"空调, 压缩机通讯故障": ["通讯故障", "故障", "一般告警", "-", 1, {"max_id": 0}]},
        # {"空调, 压缩机高压保护": ["压缩机高压保护", "告警", "一般告警", 1]},
        # {"空调, 压缩机低压保护": ["压缩机低压保护", "告警", "一般告警", 1]},
        {"空调, 设备通讯状态": ["设备通讯状态", "通讯中断", "严重告警", "-", 1, {"max_id": 0}]}]}
]
# 历史数据列表
list_eq = [

    {"监控屏IO": [
        {"监控屏IO, 烟感": [{"name": "烟感", "unit": "-", "0": "告警", "1": "正常", "max_id": 0}]},
        {"监控屏IO, 漏水": [{"name": "漏水", "unit": "-", "0": "告警", "1": "正常", "max_id": 0}]},
        {"监控屏IO, 机柜门": [{"name": "机柜门", "unit": "-", "0": "关闭", "1": "打开", "max_id": 0}]},
        {"监控屏IO, DI4": [{"name": "DI4", "unit": "-", "0": "有输入", "1": "无输入", "max_id": 0}]},
        {"监控屏IO, DI5": [{"name": "DI5", "unit": "-", "0": "有输入", "1": "无输入", "max_id": 0}]},
        {"监控屏IO, 通讯状态": [{"name": "通讯状态", "unit": "-", "0": "中断", "1": "正常", "max_id": 0}]}]},
    {"温湿度": [
        {"温湿度, 温度": [{"name": "温度", "unit": "℃", "max_id": 0}]},
        {"温湿度, 湿度": [{"name": "湿度", "unit": "%Rh", "max_id": 0}]},
        {"温湿度, 门开启温度": [{"name": "门开启温度", "unit": "℃", "max_id": 0}]},
        {"温湿度, 门关闭温度": [{"name": "门关闭温度", "unit": "℃", "max_id": 0}]},
        {"温湿度, 设备通讯状态": [{"name": "设备通讯状态", "unit": "-", "0": "中断", "1": "正常", "max_id": 0}]}]},
    {"UPS": [
        {"UPS, 输入电压": [{"name": "输入电压", "unit": "V", "max_id": 0}]},
        {"UPS, 输入频率": [{"name": "输入频率", "unit": "Hz", "max_id": 0}]},
        {"UPS, 输出电压": [{"name": "输出电压", "unit": "V", "max_id": 0}]},
        {"UPS, 输出频率": [{"name": "输出频率", "unit": "Hz", "max_id": 0}]},
        {"UPS, 输出电流": [{"name": "输出电流", "unit": "A", "max_id": 0}]},
        {"UPS, 输出负载率": [{"name": "输出负载率", "unit": "%", "max_id": 0}]},
        {"UPS, 正母线电压": [{"name": "正母线电压", "unit": "V", "max_id": 0}]},
        {"UPS, 负母线电压": [{"name": "负母线电压", "unit": "V", "max_id": 0}]},
        {"UPS, 电池电压": [{"name": "电池电压", "unit": "V", "max_id": 0}]},
        {"UPS, 最大检测温度": [{"name": "最大检测温度", "unit": "℃", "max_id": 0}]},
        {"UPS, UPS类型": [{"name": "UPS类型", "unit": "-", "0": "后备式", "1": "在线互动式", "10": "在线式", "max_id": 0}]},
        {"UPS, 市电异常": [{"name": "市电异常", "unit": "-", "0": "正常", "1": "告警", "max_id": 0}]},
        {"UPS, 电池低压": [{"name": "电池低压", "unit": "-", "0": "正常", "1": "告警", "max_id": 0}]},
        {"UPS, 旁路/逆变": [{"name": "旁路/逆变", "unit": "-", "0": "正常", "1": "有效", "max_id": 0}]},
        {"UPS, UPS故障": [{"name": "UPS故障", "unit": "-", "0": "正常", "1": "告警", "max_id": 0}]},
        {"UPS, EPO": [{"name": "EPO", "unit": "-", "0": "正常", "1": "告警", "max_id": 0}]},
        {"UPS, 测试状态": [{"name": "测试状态", "unit": "-", "0": "非测试", "1": "测试中", "max_id": 0}]},
        {"UPS, 关机有效": [{"name": "关机有效", "unit": "-", "0": "正常", "1": "关机", "max_id": 0}]},
        {"UPS, 电池静音": [{"name": "电池静音", "unit": "-", "0": "非静音", "1": "静音", "max_id": 0}]},
        {"UPS, 电池测试失败": [{"name": "电池测试失败", "unit": "-", "0": "无", "1": "失败", "max_id": 0}]},
        {"UPS, 电池测试正常": [{"name": "电池测试正常", "unit": "-", "0": "无", "1": "正常", "max_id": 0}]},
        {"UPS, 电池未接": [{"name": "电池未接", "unit": "-", "0": "正常", "1": "告警", "max_id": 0}]},
        {"UPS, 电池过充": [{"name": "电池过充", "unit": "-", "0": "正常", "1": "告警", "max_id": 0}]},
        {"UPS, 电池低压": [{"name": "电池低压", "unit": "-", "0": "正常", "1": "告警", "max_id": 0}]},
        {"UPS, 输出过载": [{"name": "输出过载", "unit": "-", "0": "正常", "1": "告警", "max_id": 0}]},
        {"UPS, 风扇堵转": [{"name": "风扇堵转", "unit": "-", "0": "正常", "1": "告警", "max_id": 0}]},
        {"UPS, EPO激活": [{"name": "EPO激活", "unit": "-", "0": "无效", "1": "生效", "max_id": 0}]},
        {"UPS, 过温": [{"name": "过温", "unit": "-", "0": "正常", "1": "告警", "max_id": 0}]},
        {"UPS, 充电器故障": [{"name": "充电器故障", "unit": "-", "0": "正常", "1": "告警", "max_id": 0}]},
        {"UPS, L1输入保险开路": [{"name": "L1输入保险开路", "unit": "-", "0": "正常", "1": "告警", "max_id": 0}]},
        {"UPS, 维护开关盖打开": [{"name": "维护开关盖打开", "unit": "-", "0": "正常", "1": "告警", "max_id": 0}]},
        {"UPS, UPS模式": [
            {"name": "UPS模式", "unit": "-", "80": "开机", "83": "待机", "89": "旁路", "76": "Line", "66": "电池供电", "84": "电池测试",
             "70": "故障", "69": "HE/ECO", "67": "Converter", "68": "关机", "max_id": 0}]},
        {"UPS, 电池电压": [{"name": "电池电压", "unit": "V", "max_id": 0}]},
        {"UPS, 电池节数": [{"name": "电池节数", "unit": "-", "max_id": 0}]},
        {"UPS, 电池组数": [{"name": "电池组数", "unit": "-", "max_id": 0}]},
        {"UPS, 电池容量": [{"name": "电池容量", "unit": "%", "max_id": 0}]},
        {"UPS, 电池剩余时间": [{"name": "电池剩余时间", "unit": "min", "max_id": 0}]},
        {"UPS, 输出功率因素": [{"name": "输出功率因素", "unit": "-", "max_id": 0}]},
        {"UPS, 输入相数": [{"name": "输入相数", "unit": "-", "max_id": 0}]},
        {"UPS, 输出相数": [{"name": "输出相数", "unit": "-", "max_id": 0}]},
        {"UPS, 输入故障电压": [{"name": "输入故障电压", "unit": "V", "max_id": 0}]},
        {"UPS, 输出故障电压": [{"name": "输出故障电压", "unit": "V", "max_id": 0}]},
        {"UPS, 额定电池节数": [{"name": "额定电池节数", "unit": "-", "max_id": 0}]},
        {"UPS, 额定电池单体电压": [{"name": "额定电池单体电压", "unit": "V", "max_id": 0}]},
        {"UPS, 错误码": [
            {"name": "错误码", "unit": "-", "0": "无故障", "1": "BUS电压启动失败", "2": "BUS电压过高", "3": "BUS电压过低", "4": "BUS电压不平衡",
             "5": "BUS电压下降斜率过快", "6": "PFC输入电感电流过大", "17": "Inverter软启动失败", "18": "Inverter电压过高", "19": "Inverter电压过低",
             "20": "L1 Inverter短路", "21": "L2 Inverter短路", "22": "L3 Inverter短路", "23": "L1L2 Inverter短路",
             "24": "L2L3 Inverter短路", "25": "L3L1 Inverter短路", "26": "L1 Inverter负功率超范围", "27": "L2 Inverter负功率超范围",
             "28": "L3 Inverter负功率超范围", "33": "电池SCR故障", "34": "Line SCR故障", "35": "Inverter继电器开路故障",
             "36": "Inverter继电器短路故障", "37": "输入输出线路接反", "38": "电池反接故障", "39": "电池电压过高", "40": "电池电压过低",
             "41": "电池FUSE开路故障", "49": "CANBus通讯故障", "50": "主机信号线路故障", "51": "同步信号线路故障", "52": "同步触发信号线路故障",
             "53": "并机通信线路丢失故障", "54": "输出严重不均流故障", "65": "温度过高", "66": "控制板中CPU间通讯故障", "67": "过载故障", "68": "风扇模组故障",
             "69": "充电器故障", "70": "机型错误", "71": "控制板与通讯板MCU通讯故障", "max_id": 0}]},
        {"UPS, UPS简化模式": [
            {"name": "UPS简化模式", "unit": "-", "0": "待机/关机", "1": "旁路", "2": "市电", "3": "电池", "max_id": 0}]},
        {"UPS, 设备通讯状态": [{"name": "设备通讯状态", "unit": "-", "0": "通讯中断", "1": "通讯正常", "max_id": 0}]}]},
    {"主路电表": [
        {"主路电表, 当前组合有功电能": [{"name": "当前组合有功电能", "unit": "Kwh", "max_id": 0}]},
        {"主路电表, 当前正向有功电能": [{"name": "当前正向有功电能", "unit": "Kwh", "max_id": 0}]},
        {"主路电表, 当前反向有功电能": [{"name": "当前反向有功电能", "unit": "Kwh", "max_id": 0}]},
        {"主路电表, 电压": [{"name": "电压", "unit": "V", "max_id": 0}]},
        {"主路电表, 电流": [{"name": "电流", "unit": "A", "max_id": 0}]},
        {"主路电表, 功率": [{"name": "功率", "unit": "Kw", "max_id": 0}]},
        {"主路电表, 功率因数": [{"name": "功率因数", "unit": "-", "max_id": 0}]},
        {"主路电表, 频率": [{"name": "频率", "unit": "Hz", "max_id": 0}]},
        {"主路电表, 设备通讯状态": [{"name": "设备通讯状态", "unit": "-", "0": "通讯中断", "1": "通讯正常", "max_id": 0}]}]},
    {"IT负载电表": [
        {"主路电表, 当前组合有功电能": [{"name": "当前组合有功电能", "unit": "Kwh", "max_id": 0}]},
        {"主路电表, 当前正向有功电能": [{"name": "当前正向有功电能", "unit": "Kwh", "max_id": 0}]},
        {"主路电表, 当前反向有功电能": [{"name": "当前反向有功电能", "unit": "Kwh", "max_id": 0}]},
        {"主路电表, 电压": [{"name": "电压", "unit": "V", "max_id": 0}]},
        {"主路电表, 电流": [{"name": "电流", "unit": "A", "max_id": 0}]},
        {"主路电表, 功率": [{"name": "功率", "unit": "Kw", "max_id": 0}]},
        {"主路电表, 功率因数": [{"name": "功率因数", "unit": "-", "max_id": 0}]},
        {"主路电表, 频率": [{"name": "频率", "unit": "Hz", "max_id": 0}]},
        {"主路电表, 设备通讯状态": [{"name": "设备通讯状态", "unit": "-", "0": "通讯中断", "1": "通讯正常", "max_id": 0}]}]},

    {"空调": [
        {"空调, 吸气温度探头故障": [{"name": "吸气温度探头故障", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 送风温度探头故障": [{"name": "送风温度探头故障", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 吸气压力探头故障": [{"name": "吸气压力探头故障", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 排气压力探头故障": [{"name": "排气压力探头故障", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 回风温度探头故障": [{"name": "回风温度探头故障", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 回风湿度探头故障": [{"name": "回风湿度探头故障", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 温度过高": [{"name": "温度过高", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 送风温度过低": [{"name": "送风温度过低", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 湿度过高": [{"name": "湿度过高", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 湿度过低": [{"name": "湿度过低", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 水溢报警": [{"name": "水溢报警", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 漏水报警": [{"name": "漏水报警", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 高压保护开关": [{"name": "高压保护开关", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 低压保护开关": [{"name": "低压保护开关", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 烟雾报警": [{"name": "烟雾报警", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 送风机故障": [{"name": "送风机故障", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 加湿器故障": [{"name": "加湿器故障", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 电加热故障": [{"name": "电加热故障", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 水泵故障": [{"name": "水泵故障", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 低压压力报警": [{"name": "低压压力报警", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 电流过载": [{"name": "电流过载", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 排气压力过高报警": [{"name": "排气压力过高报警", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 压缩机内部故障": [{"name": "压缩机内部故障", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 压缩机通讯故障": [{"name": "压缩机通讯故障", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 送风机": [{"name": "送风机", "unit": "-", "0": "关闭", "1": "开启", "max_id": 0}]},
        {"空调, 压缩机": [{"name": "压缩机", "unit": "-", "0": "关闭", "1": "开启", "max_id": 0}]},
        {"空调, 冷凝水泵": [{"name": "冷凝水泵", "unit": "-", "0": "关闭", "1": "开启", "max_id": 0}]},
        {"空调, 低温电磁阀": [{"name": "低温电磁阀", "unit": "-", "0": "关闭", "1": "开启", "max_id": 0}]},
        {"空调, 故障": [{"name": "故障", "unit": "-", "0": "正常", "1": "故障", "max_id": 0}]},
        {"空调, 远控": [{"name": "远控", "unit": "-", "0": "关闭", "1": "开启", "max_id": 0}]},
        {"空调, 开关机": [{"name": "开关机", "unit": "-", "0": "关闭", "1": "开启", "max_id": 0}]},
        {"空调, 温度设定": [{"name": "温度设定", "unit": "℃", "max_id": 0}]},
        {"空调, 湿度设置": [{"name": "湿度设置", "unit": "%", "max_id": 0}]},
        {"空调, 来电自启动": [{"name": "来电自启动", "unit": "-", "0": "禁用", "1": "启用", "max_id": 0}]},
        {"空调, 温度回差": [{"name": "温度回差", "unit": "℃", "max_id": 0}]},
        {"空调, 湿度回差": [{"name": "湿度回差", "unit": "%", "max_id": 0}]},
        {"空调, 除湿使能": [{"name": "除湿使能", "unit": "-", "0": "禁用", "1": "启用", "max_id": 0}]},
        {"空调, 联网地址设置": [{"name": "联网地址设置", "unit": "-", "max_id": 0}]},
        {"空调, 压缩机电流过载": [{"name": "压缩机电流过载", "unit": "A", "max_id": 0}]},
        {"空调, 控制方式": [{"name": "控制方式", "unit": "-", "0": "回风", "1": "送风", "max_id": 0}]},
        {"空调, 吸气压力量程": [{"name": "吸气压力量程", "unit": "Bar", "max_id": 0}]},
        {"空调, 最低送风温度": [{"name": "最低送风温度", "unit": "℃", "max_id": 0}]},
        {"空调, 最高送风温度": [{"name": "最高送风温度", "unit": "℃", "max_id": 0}]},
        {"空调, 高温报警": [{"name": "高温报警", "unit": "℃", "max_id": 0}]},
        {"空调, 送风低温报警": [{"name": "送风低温报警", "unit": "℃", "max_id": 0}]},
        {"空调, 高湿报警": [{"name": "高湿报警", "unit": "%", "max_id": 0}]},
        {"空调, 低湿报警": [{"name": "低湿报警", "unit": "%", "max_id": 0}]},
        {"空调, 吸气压力报警": [{"name": "吸气压力报警", "unit": "Bar", "max_id": 0}]},
        {"空调, 排气压力量程": [{"name": "排气压力量程", "unit": "Bar", "max_id": 0}]},
        {"空调, 排压压力报警": [{"name": "排压压力报警", "unit": "Bar", "max_id": 0}]},
        {"空调, 送风机输出": [{"name": "送风机输出", "unit": "%", "max_id": 0}]},
        {"空调, 机组运行时间": [{"name": "机组运行时间", "unit": "-", "max_id": 0}]},
        {"空调, 压机运行时间": [{"name": "压机运行时间", "unit": "-", "max_id": 0}]},
        {"空调, 过热度": [{"name": "过热度", "unit": "℃", "max_id": 0}]},
        {"空调, EEV开度": [{"name": "EEV开度", "unit": "%", "max_id": 0}]},
        {"空调, 吸气温度": [{"name": "吸气温度", "unit": "℃", "max_id": 0}]},
        {"空调, 送风温度": [{"name": "送风温度", "unit": "℃", "max_id": 0}]},
        {"空调, 吸气压力": [{"name": "吸气压力", "unit": "Bar", "max_id": 0}]},
        {"空调, 排气压力": [{"name": "排气压力", "unit": "Bar", "max_id": 0}]},
        {"空调, 室内温度": [{"name": "室内温度", "unit": "℃", "max_id": 0}]},
        {"空调, 室内湿度": [{"name": "室内湿度", "unit": "%", "max_id": 0}]},
        {"空调, 压缩机频率": [{"name": "压缩机频率", "unit": "Hz", "max_id": 0}]},
        {"空调, 蒸发温度": [{"name": "蒸发温度", "unit": "℃", "max_id": 0}]},
        {"空调, 滤网维护故障": [{"name": "滤网维护故障", "unit": "-", "0": "故障", "1": "正常", "max_id": 0}]},
        {"空调, 制热开偏差": [{"name": "制热开偏差", "unit": "℃", "max_id": 0}]},
        {"空调, 制热关偏差": [{"name": "制热关偏差", "unit": "℃", "max_id": 0}]},
        {"空调, 加湿使能": [{"name": "加湿使能", "unit": "-", "0": "禁止", "1": "使能", "max_id": 0}]},
        {"空调, 加热使能": [{"name": "加热使能", "unit": "-", "0": "禁止", "1": "使能", "max_id": 0}]},
        {"空调, 变频器工作状态": [{"name": "变频器工作状态", "unit": "-", "0": "通讯中断", "1": "通讯正常", "max_id": 0}]},
        {"空调, 电加热": [{"name": "电加热", "unit": "-", "0": "关闭", "1": "开启", "max_id": 0}]},
        {"空调, 加湿器": [{"name": "加湿器", "unit": "-", "0": "关闭", "1": "开启", "max_id": 0}]},
        {"空调, 旁通电磁阀": [{"name": "旁通电磁阀", "unit": "-", "0": "关闭", "1": "开启", "max_id": 0}]},
        {"空调, 液管温度": [{"name": "液管温度", "unit": "℃", "max_id": 0}]},
        {"空调, 设备通讯状态": [{"name": "设备通讯状态", "unit": "-", "0": "通讯中断", "1": "通讯正常", "max_id": 0}]}]}
]


# 查询设备列表
def get_equipment(request):
    site_list = []
    for item in list:
        for equipment, value in item.items():
            site_list.append(equipment)
    # 转换成json格式传送
    json_list = json.dumps(site_list)
    return JsonResponse(json_list, safe=False)


# 历史数据页面 对应的曲线图
def post_historydata(request):
    json_str = request.body
    json_str = json_str.decode()  # python3.6 版本以上不需要解码了
    request_data = json.loads(json_str)
    equipment = request_data['item']
    starttime = request_data['starttime']
    endtime = request_data['endtime']
    # print(equipment)
    # 得到一个区间列表
    obj_list = EquipmentData.objects.filter(
        Q(equipment__contains=equipment) & Q(equipment_time__gt=starttime) & Q(equipment_time__lt=endtime))
    # print(obj_list)
    # 发送数据列表
    Eqdata_list = []
    for obj_eq in obj_list:
        data = {}
        data["equipment"] = obj_eq.equipment
        data["name"] = obj_eq.equipment_name
        data["sigid"] = obj_eq.equipment_folat
        data["unit"] = obj_eq.equipment_unit
        data["float_data"] = obj_eq.equipment_text
        data["data_time"] = obj_eq.equipment_time
        Eqdata_list.append(data)
    # print(Eqdata_list)
    return JsonResponse(Eqdata_list, safe=False)


# 历史告警
def post_historyalarm(request):
    json_str = request.body
    json_str = json_str.decode()  # python3.6 版本以上不需要解码了
    request_data = json.loads(json_str)
    equipment = request_data['item']
    starttime = request_data['starttime']
    endtime = request_data['endtime']
    warning_list = Warning.objects.filter(
        Q(warn_name__contains=equipment) & Q(warn_time__gt=starttime) & Q(warn_time__lt=endtime))
    # 当值为 0 1变化时
    data_list = []
    start_time = []  # 所有的告警时间
    end_time = []  #
    flag = True
    # print(len(warning_list))
    # print(warning_list[len(warning_list) - 1].warn_data)
    for index, i in enumerate(warning_list):
        if flag and int(i.warn_data) == 1:
            pass
        if flag and int(i.warn_data) == 0:
            start_time.append(i.warn_time)
            flag = False
        if not flag and int(i.warn_data) == 1:
            end_time.append(i.warn_time)
            flag = True
        if index == (len(warning_list) - 1) and int(warning_list[len(warning_list) - 1].warn_data) == 0:
            end_time.append("Null")
    # print(start_time)
    # print(end_time)
    for index, item in enumerate(start_time):
        warn_obj = Warning.objects.filter(warn_time=item).first()
        data = {}
        data["equipment"] = warn_obj.warn_name
        data["information"] = warn_obj.warn_data
        data["unit"] = warn_obj.unit
        data["warn_level"] = warn_obj.warn_level
        data["warn_text"] = warn_obj.warn_text
        data["start_time"] = item
        data["end_time"] = end_time[index]
        data_list.append(data)

    return JsonResponse(data_list, safe=False)

